export default {
  login: /(?!\d+$)^[A-Za-z0-9_-]{3,20}$/,
  password: /(?=.*[A-Z])[A-Za-z0-9_-]{7,40}$/,
  first_name: /^(?!\b(\w+)\b(?:[-\s]+\1\b))([A-ZА-ЯЁ][a-zа-яё]*)(?:[-\s]([A-ZА-ЯЁ][a-zа-яё]*))?$/,
  second_name: /^(?!\b(\w+)\b(?:[-\s]+\1\b))([A-ZА-ЯЁ][a-zа-яё]*)(?:[-\s]([A-ZА-ЯЁ][a-zа-яё]*))?$/,
  email: /^[A-Za-z0-9](-|_|\.)?(([A-Za-z0-9_\.]+-?)?)+[A-Za-z0-9]?@([A-Za-z0-9\-_]+\.)+[A-Za-z]{2,}/,
  phone: /(\+7|8)((\d{3}\d{3}\d{2}\d{2}|\s\d{3}[\-]\d{3}[\-]\d{2}[\-]\d{2})|\(\d{3}\)\s?\d{3}[\-]\d{2}[\-]\d{2})/,
  message: /\w{1,}/
}
